// let - ცვლადია, რომლის მნიშვნელობა შეგვიძლია შემდეგში შევცვალოთ
let name = "Gabi";
let age = 13;
let city = "Tbilisi";

// const - ცვლადია, რომლის მნიშვნელობა გამოცხადების შემდეგ ვეღარ იცვლება
const country = "Georgia";
const pi = 3.14159;
const birthYear = 2011;

/*
let - ის მნიშვნელობა შეგვიძლია მომავალში შევცვალოთ, მაგალითად:
name = "GABI"; // ეს ნებადართულია
*/

/*
const - ის მნიშვნელობა გამოცხადების შემდეგ შეცვლას ვერ დავუშვებთ, მაგალითად:
country = "Armenia"; // ეს შეცდომას გამოიწვევს
*/

/*
let და const განსხვავდება იმით, რომ:
- let გაძლევს უფლებას ცვლადის მნიშვნელობა შეცვალო.
- const გაძლევს საშუალებას ცვლადი ერთხელ დაამტკიცო და მისი მნიშვნელობა აღარ შეცვალო.
*/